{"<PAD>": 0, "<SOS>": 1, "<EOS>": 2, "<UNK>": 3, "analytical": 4, "thinking": 5, "how": 6, "confident": 7, "are": 8, "you": 9, "in": 10, "your": 11, "thinking?": 12, "[a]": 13, "absolutely": 14, "[b]": 15, "not": 16, "really": 17, "[c]": 18, "definitely": 19, "[d]": 20, "maybe": 21, "system": 22, "architecture": 23, "interested": 24, "tasks": 25, "involving": 26, "architecture?": 27, "strongly": 28, "disagree": 29, "agree": 30, "critical": 31, "would": 32, "like": 33, "to": 34, "improve": 35, "rarely": 36, "never": 37, "neutral": 38, "highly": 39, "motivated": 40, "adaptability": 41, "do": 42, "feel": 43, "by": 44, "activities": 45, "adaptability?": 46, "cybersecurity": 47, "fundamentals": 48, "much": 49, "value": 50, "work": 51, "environment?": 52, "no": 53, "experience": 54, "very": 55, "somewhat": 56, "api": 57, "integration": 58, "does": 59, "the": 60, "idea": 61, "of": 62, "practicing": 63, "appeal": 64, "you?": 65, "at": 66, "all": 67, "independence": 68, "enjoy": 69, "opportunities": 70, "focused": 71, "on": 72, "independence?": 73, "dependability": 74, "dependability?": 75, "initiative": 76, "initiative?": 77, "working": 78, "projects": 79, "that": 80, "require": 81, "oral": 82, "expression": 83, "what": 84, "extent": 85, "excite": 86, "evaluation": 87, "evaluation?": 88, "linux": 89, "administration": 90, "administration?": 91, "testing": 92, "and": 93, "debugging": 94, "debugging?": 95, "integrity": 96, "devops": 97, "practices": 98, "practices?": 99, "persistence": 100, "persistence?": 101, "agile": 102, "methodology": 103, "methodology?": 104, "stress": 105, "tolerance": 106, "tolerance?": 107, "python": 108, "programming": 109, "programming?": 110, "decision": 111, "making": 112, "making?": 113, "time": 114, "management": 115, "management?": 116, "javascript": 117, "javascript?": 118, "see": 119, "yourself": 120, "using": 121, "frequently": 122, "career?": 123, "logical": 124, "reasoning": 125, "reasoning?": 126, "uiux": 127, "design": 128, "version": 129, "control": 130, "git": 131, "git?": 132, "attention": 133, "detail": 134, "detail?": 135, "integrity?": 136, "creativity": 137, "creativity?": 138, "problem": 139, "solving": 140, "solving?": 141, "cooperation": 142, "cooperation?": 143, "team": 144, "collaboration": 145, "collaboration?": 146, "leadership": 147, "communication": 148, "communication?": 149, "expression?": 150, "leadership?": 151, "integration?": 152, "fundamentals?": 153, "mobile": 154, "development": 155, "development?": 156, "cloud": 157, "computing": 158, "data": 159, "analysis": 160, "analysis?": 161, "computing?": 162, "learning": 163, "strategies": 164, "strategies?": 165, "design?": 166, "innovation": 167, "machine": 168, "learning?": 169, "innovation?": 170, "written": 171, "comprehension": 172, "comprehension?": 173, "database": 174}